app/views/notes/_note.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  %span.timestamp
    Posted #{time_ago_in_words(note.created_at)} ago in #{note.group.try(:name)}.
  - if current_user?(note.user)