app/views/users/show.html.haml

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 ORDER BY notes.created_at DESC
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1
---
  .span8
    - if user.notes.any?