app/views/shared/_user_info.html.haml

SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1
---
    %span
      = pluralize(current_user.notes.count, "note")