app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is a note!"], ["created_at", Sat, 04 Aug 2012 19:12:46 UTC +00:00], ["updated_at", Sat, 04 Aug 2012 19:12:46 UTC +00:00], ["user_id", 1]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1
---
  def create
    note = current_user.notes.build(params[:note])
    if note.save
      flash[:success] = "Note created!"
      redirect_to root_path
    else
      if note.errors.any?