app/controllers/pages_controller.rb

  def home
    if signed_in?
      note = current_user.notes.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1