app/controllers/users_controller.rb

  def show
    @notes = user.notes.paginate(page: params[:page])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 ORDER BY notes.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1

  def create
    if user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "provider", "remember_token", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'The Real Brian Dear', "password_digest" = '$2a$10$88xg4OM.4tJWG/RlknjQoOQfAkkuRaUqGGoETmKwdiWbqwaovQA4e', "remember_token" = 'D9teH-EYeHoh7WPfLqq77w', "updated_at" = '2012-08-03 03:16:16.769378' WHERE "users"."id" = 4